Revit 2024 API
BuiltInFailures.AssemblyFailures.DeleteShopDrawingsWarn Property
 The assembly instance has associated views and cannot be merged with assembly type '%1!s!'. Delete the views to continue.\n\nViews:%2!s!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeleteShopDrawingsWarn { get; }
Visual Basic
Public Shared ReadOnly Property DeleteShopDrawingsWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeleteShopDrawingsWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace